SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0020/MM32L0020_Application/Device/MM32L0020/Include/reg_adc.h
/***********************************************************************************************************************
    @file     reg_adc.h
    @author   VV TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
              MM32 FIRMWARE LIBRARY.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/


/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_ADC_H
#define __REG_ADC_H

/* Files includes ------------------------------------------------------------*/
#include <core_cm0plus.h>

#if defined(__CC_ARM)
#pragma anon_unions
#endif

/**
  * @brief ADC Base Address Definition
  */
#define ADC1_BASE                       (APB2PERIPH_BASE + 0x2400) /*!< Base Address: 0x40012400 */

/**
  * @brief Analog-to-Digital Converter register
  */

typedef struct
{
    __IO uint32_t ADDATA;               /*!< ADC data register,                             offset: 0x00 */
    __IO uint32_t ADCFG;                /*!< ADC configuration register,                    offset: 0x04 */
    __IO uint32_t ADCR;                 /*!< ADC control register,                          offset: 0x08 */
    __IO uint32_t ADCHS;                /*!< ADC channel selection register,                offset: 0x0C */
    __IO uint32_t ADCMPR;               /*!< ADC window compare register,                   offset: 0x10 */
    __IO uint32_t ADSTA;                /*!< ADC status register,                           offset: 0x14 */
    __IO uint32_t ADDR0;                /*!< ADC channel0 data register,                    offset: 0x18 */
    __IO uint32_t ADDR1;                /*!< ADC channel1 data register,                    offset: 0x1C */
    __IO uint32_t ADDR2;                /*!< ADC channel2 data register,                    offset: 0x20 */
    __IO uint32_t ADDR3;                /*!< ADC channel3 data register,                    offset: 0x24 */
    __IO uint32_t ADDR4;                /*!< ADC channel4 data register,                    offset: 0x28 */
    __IO uint32_t ADDR5;                /*!< ADC channel5 data register,                    offset: 0x2C */
    __IO uint32_t ADDR6;                /*!< ADC channel6 data register,                    offset: 0x30 */
    __IO uint32_t ADDR7;                /*!< ADC channel7 data register,                    offset: 0x34 */
    __IO uint32_t ADDR8;                /*!< ADC channel8 data register,                    offset: 0x38 */
    __IO uint32_t RESERVED0x3C[7];      /*!< RESERVED                                       offset: 0x3C-0x54 */
    __IO uint32_t ADSTA_EXT;            /*!< ADC Extended Status Register,                  offset: 0x58 */
    __IO uint32_t CHANY0;               /*!< ADC any Chan Select Register 0,                offset: 0x5C */
    __IO uint32_t CHANY1;               /*!< ADC any Chan Select Register 1,                offset: 0x60 */
    __IO uint32_t ANY_CFG;              /*!< ADC any Chan config Register,                  offset: 0x64 */
    __IO uint32_t ANY_CR;               /*!< ADC any Chan control Register,                 offset: 0x68 */
    __IO uint32_t RESERVED0x6C;         /*!< RESERVED                                       offset 0x6C */
    __IO uint32_t SMPR1;                /*!< Sampling configuration register 1              offset 0x70 */
    __IO uint32_t SMPR2;                /*!< Sampling configuration register 2              offset 0x74 */
    __IO uint32_t RESERVED0x78;         /*!< RESERVED                                       offset 0x78 */
    __IO uint32_t JOFR0;                /*!< Injection channel data compensation register 0 offset 0x7C */
    __IO uint32_t JOFR1;                /*!< Injection channel data compensation register 1 offset 0x80 */
    __IO uint32_t JOFR2;                /*!< Injection channel data compensation register 2 offset 0x84 */
    __IO uint32_t JOFR3;                /*!< Injection channel data compensation register 3 offset 0x88 */
    __IO uint32_t JSQR;                 /*!< Injection sequence register                    offset 0x8C */
    __IO uint32_t JADDATA;              /*!< Inject data register                           offset 0x90 */
    __IO uint32_t RESERVED0x94[7];      /*!< RESERVED                                       offset 0x94-0xAC */
    __IO uint32_t JDR0;                 /*!< Injection channel data register 0              offset 0xB0 */
    __IO uint32_t JDR1;                 /*!< Injection channel data register 1              offset 0xB4 */
    __IO uint32_t JDR2;                 /*!< Injection channel data register 2              offset 0xB8 */
    __IO uint32_t JDR3;                 /*!< Injection channel data register 3              offset 0xBC */
} ADC_TypeDef;

/**
  * @brief ADC type pointer Definition
  */
#define ADC1                            ((ADC_TypeDef *)ADC1_BASE)

/**
  * @brief ADC_ADDATA Register Bit Definition
  */
#define ADC_ADDATA_DATA_Pos             (0)
#define ADC_ADDATA_DATA                 (0xFFFFU << ADC_ADDATA_DATA_Pos)        /*!< ADC 12bit convert data */

#define ADC_ADDATA_CHANNELSEL_Pos       (16)
#define ADC_ADDATA_CHANNELSEL           (0x0FU << ADC_ADDATA_CHANNELSEL_Pos)    /*!< CHANNELSEL[19:16] (ADC current channel convert data) */

#define ADC_ADDATA_OVERRUN_Pos          (20)
#define ADC_ADDATA_OVERRUN              (0x01U << ADC_ADDATA_OVERRUN_Pos)       /*!< ADC data will be cover */
#define ADC_ADDATA_VALID_Pos            (21)
#define ADC_ADDATA_VALID                (0x01U << ADC_ADDATA_VALID_Pos)         /*!< ADC data[11:0] is valid */

/**
  * @brief ADC_CFGR Register Bit Definition
  */
#define ADC_ADCFG_ADEN_Pos              (0)
#define ADC_ADCFG_ADEN                  (0x01U << ADC_ADCFG_ADEN_Pos)    /*!< Enable ADC convert */
#define ADC_ADCFG_AWDEN_Pos             (1)
#define ADC_ADCFG_AWDEN                 (0x01U << ADC_ADCFG_AWDEN_Pos)   /*!< Enable ADC window compare */
#define ADC_ADCFG_VSEN_Pos              (3)
#define ADC_ADCFG_VSEN                  (0x01U << ADC_ADCFG_VSEN_Pos)    /*!< Voltage Sensor Enable */

